export const COLORS = [
  { label: 'Білий', value: 'білий', hex: '#FFFFFF' },
  { label: 'Чорний', value: 'чорний', hex: '#000000' },
  { label: 'Сірий', value: 'сірий', hex: '#808080' },
  { label: 'Сріблястий', value: 'сріблястий', hex: '#C0C0C0' },
  { label: 'Червоний', value: 'червоний', hex: '#FF0000' },
  { label: 'Синій', value: 'синій', hex: '#0000FF' },
  { label: 'Блакитний', value: 'блакитний', hex: '#ADD8E6' },
  { label: 'Зелений', value: 'зелений', hex: '#008000' },
  { label: 'Жовтий', value: 'жовтий', hex: '#FFFF00' },
  { label: 'Коричневий', value: 'коричневий', hex: '#A52A2A' },
  { label: 'Помаранчевий', value: 'помаранчевий', hex: '#FFA500' },
  { label: 'Фіолетовий', value: 'фіолетовий', hex: '#800080' },
  { label: 'Бежевий', value: 'бежевий', hex: '#F5F5DC' },
];

export const BODY_TYPES = [
  'Седан','Хетчбек','Універсал','Позашляховик / Кросовер',
  'Купе','Мінівен','Пікап','Кабріолет','Фургон',
  'Мопед','Мотоцикл','Трицикл','Скутер','Велосипед',
  'Електроскутер','Електровелосипед','Електротрицикл','Електромотоцикл'
].map(t => ({ label: t, value: t.toLowerCase() }));
